{
    "legal": {
        "menu_title": "Legal",
        "on_this_page": "On This Page",
        "privacy_policy": "Privacy Policy",
        "terms_conditions": "Terms and Conditions",
        "cookie_policy": "Cookie Policy",
        "disclaimers": "Disclaimers",
        "cookie": {
            "subtitle": "This policy explains how our website uses cookies and similar technologies to ensure proper functionality, enhance user experience, and support our service processes.",
            "intro_title": "Introduction",
            "intro_text": "Welcome to the Cookie Policy of Ta' To' Clean. This policy explains how our website uses cookies and similar technologies to ensure proper functionality, enhance user experience, and support our service processes, including booking management, customer interaction, and analytics. This Cookie Policy must be read together with our Privacy Policy and Terms & Conditions.",
            "important_title": "Important Information",
            "important_purpose_subtitle": "1.1 Purpose of this Cookie Policy",
            "important_purpose_text": "This Cookie Policy explains: What cookies are. What types of cookies we use. Why we use them. How users can manage, disable, or delete cookies. Which third parties may set cookies through our website.",
            "important_controller_subtitle": "1.2 Controller",
            "important_controller_text": "Ta' To' Clean is responsible for the processing of data associated with cookies used on our website.",
            "what_are_title": "What Are Cookies?",
            "what_are_text": "Cookies are small text files stored on your device when you visit our website. They allow us to recognize your browser, remember preferences, support technical processes such as appointment bookings, and improve performance. Cookies may be: Session cookies: deleted once the browser closes. Persistent cookies: remain on your device for a defined period. First-party: set by Ta' To' Clean. Third-party: set by external service providers.",
            "types_title": "Types of Cookies We Use",
            "types_necessary_subtitle": "3.1 Strictly Necessary Cookies",
            "types_necessary_text": "These cookies are essential for the operation of the website and for enabling services such as: Completing appointment reservations. Temporarily storing booking information (name, email, phone, preferred date, and vehicle plate). Website security and fraud prevention. Technical functionality. These cookies cannot be disabled.",
            "types_functional_subtitle": "3.2 Functional / Preference Cookies",
            "types_functional_text": "Used to improve the user experience by remembering: Language settings. Basic page preferences. Optional form data retention.",
            "types_analytical_subtitle": "3.3 Analytical and Performance Cookies",
            "types_analytical_text": "Used to evaluate: How users interact with the booking process. Most visited sections of the website. Website performance, bounce rates, and errors. Third-party analytics may include: Google Analytics, Meta Pixel, Hosting provider monitoring tools. These require user consent.",
            "types_marketing_subtitle": "3.4 Marketing and Tracking Cookies (if applicable)",
            "types_marketing_text": "Used to: Measure advertisement effectiveness. Conduct remarketing campaigns. Build anonymized interest profiles. These require explicit consent.",
            "info_collected_title": "Information Collected Through Cookies",
            "info_collected_text": "Depending on the type of cookie, they may collect: IP address, Device characteristics, Browser type, Session identifiers, Booking process steps, User click interactions, Date and time of visits. Cookies do not store raw personal data (name, email, phone, or license plate), but may interact with systems where such data is submitted securely.",
            "managing_title": "Managing Cookies",
            "managing_text": "Users can configure, accept, or reject cookies (except necessary cookies) through the cookie banner and through browser settings. Limiting cookies may affect booking functionality.",
            "updates_title": "Updates to This Cookie Policy",
            "updates_text": "Ta' To' Clean may update this policy at any time. The 'Last Updated' date will reflect changes."
        }
    }
}