{
    "privacy": {
        "subtitle": "Ta' To' Clean is committed to safeguarding your personal data. This Privacy Policy describes how we collect, use, store, and protect your information.",
        "intro_title": "Introduction",
        "intro_text": "Ta' To' Clean is committed to safeguarding your personal data. This Privacy Policy describes how we collect, use, store, and protect your information when you access our website, use our services, or interact with us. This policy complies with Colombian data protection law (Law 1581 of 2012, Decree 1377 of 2013).",
        "collection_title": "Information We Collect",
        "collection_text": "We collect information that you provide directly to us when: You create an account. You book a service. You contact us for support.",
        "collection_personal_subtitle": "1.1 Personal Information",
        "collection_personal_text": "Full name, Email address, Phone number, Address (when required for mobile services).",
        "collection_vehicle_subtitle": "1.2 Vehicle Information",
        "collection_vehicle_text": "Vehicle plate, Brand and model (optional), User-assigned nickname.",
        "collection_technical_subtitle": "1.3 Technical Information",
        "collection_technical_text": "IP address, Browser type, Cookie data (see our Cookie Policy).",
        "use_title": "How We Use Your Information",
        "use_text": "We use your information to: Process bookings and manage appointments. Communicate with you about your services. Improve our services and user experience. Send promotional updates (with your consent). Comply with legal obligations.",
        "storage_title": "Data Storage and Retention",
        "storage_text": "Your data is stored on Supabase (secure database provider) with cloud-located servers. We retain your data while you maintain an active account or as necessary to provide services. You can request data deletion at any time.",
        "sharing_title": "Data Sharing",
        "sharing_text": "We do not sell, trade, or otherwise transfer your personal information to third parties, except: Service providers (e.g., Supabase for storage). When required by law. With your explicit consent.",
        "rights_title": "Your Rights",
        "rights_text": "You have the right to: Access your personal data. Correct inaccurate information. Request deletion of your data. Revoke consent for data processing. You can manage your information through your account dashboard.",
        "cookies_title": "Cookies and Tracking",
        "cookies_text": "See our Cookie Policy for detailed information on how we use cookies and similar technologies.",
        "security_title": "Security Measures",
        "security_text": "We implement technical and organizational measures to protect your data against unauthorized access, loss, or damage. However, no system is 100% secure.",
        "minors_title": "Children and Minors",
        "minors_text": "Our services are not directed to individuals under 18 years of age. We do not knowingly collect information from minors.",
        "updates_title": "Updates to This Policy",
        "updates_text": "We may update this Privacy Policy occasionally. We will notify you of significant changes by email or through a notice on our website.",
        "contact_title": "Contact Information",
        "contact_text": "For privacy questions or data requests, contact us at: Email: privacy@tatotoclean.com"
    },
    "terms": {
        "subtitle": "Please review our terms and conditions to fully understand how we handle your interactions with this website.",
        "intro_title": "Introduction",
        "intro_text": "These Terms and Conditions govern the use of Ta' To' Clean's website, booking platform, and services. By using our website, you agree to these Terms.",
        "services_title": "Services Provided",
        "services_text": "Ta' To' Clean provides automotive detailing and cleaning services. We reserve the right to refuse service to anyone for any reason at any time.",
        "booking_title": "Bookings and Payments",
        "booking_text": "Bookings are subject to availability. Prices for our services are subject to change without notice.",
        "booking_process_subtitle": "3.1 Booking Process",
        "booking_process_text": "Bookings are made through our website. You must provide accurate vehicle and contact information. You will receive a confirmation email once the booking is complete.",
        "booking_payment_subtitle": "3.2 Payment Policy",
        "booking_payment_text": "Payment is processed at the time of service. We accept multiple payment methods. Prices include applicable taxes.",
        "accounts_title": "User Accounts",
        "accounts_text": "You are responsible for maintaining the confidentiality of your account. You must not share your access credentials. We reserve the right to suspend or terminate accounts that violate these Terms.",
        "liability_title": "Limitation of Liability",
        "liability_text": "Ta' To' Clean shall not be liable for any indirect, incidental, special, consequential or punitive damages, including without limitation, loss of profits, data, use, goodwill, or other intangible losses.",
        "cancellation_title": "Cancellation Policy",
        "cancellation_text": "You may cancel your booking up to 24 hours before the scheduled time for a full refund. Late cancellations may be subject to a fee.",
        "ip_title": "Intellectual Property",
        "ip_text": "All content on this website (text, graphics, logos) is owned by Ta' To' Clean and protected by intellectual property laws. You may not use our content without explicit permission.",
        "changes_title": "Changes to Terms",
        "changes_text": "We reserve the right, at our sole discretion, to modify or replace these Terms at any time. Significant changes will take effect 30 days after posting."
    },
    "disclaimers": {
        "title": "Disclaimers",
        "subtitle": "The information provided by Ta' To' Clean on our website is for general informational purposes only.",
        "service_title": "Service Results Disclaimer",
        "service_text": "Detailing results vary depending on: Previous vehicle condition. Surface deterioration. Environmental conditions. 100% defect correction is not guaranteed.",
        "vehicle_title": "Vehicle Condition",
        "vehicle_text": "While we take every precaution to ensure the safety of your vehicle while in our care, we are not liable for loss or damage due to theft, fire, or natural disasters beyond our control. We are not responsible for pre-existing damage.",
        "links_title": "External Links Disclaimer",
        "links_text": "The Site may contain links to other websites or content belonging to or originating from third parties. Such external links are not investigated, monitored, or checked for accuracy, adequacy, validity, reliability, availability, or completeness by us.",
        "advice_title": "Professional Advice",
        "advice_text": "The information on our website is for general informational purposes only. It should not be considered professional advice. Always seek the advice of a qualified professional with any questions you may have."
    }
}