{
    "legal": {
        "menu_title": "Legal",
        "on_this_page": "En Esta Página",
        "privacy_policy": "Política de Privacidad",
        "terms_conditions": "Términos y Condiciones",
        "cookie_policy": "Política de Cookies",
        "disclaimers": "Descargos de Responsabilidad",
        "cookie": {
            "subtitle": "Esta política explica cómo nuestro sitio web usa cookies y tecnologías similares para garantizar la funcionalidad adecuada, mejorar la experiencia del usuario y respaldar nuestros procesos de servicio.",
            "intro_title": "Introducción",
            "intro_text": "Bienvenido a la Política de Cookies de Ta' To' Clean. Esta política explica cómo nuestro sitio web utiliza cookies y tecnologías similares para garantizar el correcto funcionamiento, mejorar la experiencia del usuario y respaldar nuestros procesos de servicio, incluida la gestión de reservas, la interacción con los clientes y el análisis. Esta Política de Cookies debe leerse junto con nuestra Política de Privacidad y Términos y Condiciones.",
            "important_title": "Información Importante",
            "important_purpose_subtitle": "1.1 Propósito de esta Política de Cookies",
            "important_purpose_text": "Esta Política de Cookies explica: Qué son las cookies. Qué tipos de cookies utilizamos. Por qué las utilizamos. Cómo los usuarios pueden administrar, deshabilitar o eliminar cookies. Qué terceros pueden establecer cookies a través de nuestro sitio web.",
            "important_controller_subtitle": "1.2 Responsable",
            "important_controller_text": "Ta' To' Clean es responsable del procesamiento de datos asociados con las cookies utilizadas en nuestro sitio web.",
            "what_are_title": "¿Qué son las Cookies?",
            "what_are_text": "Las cookies son pequeños archivos de texto almacenados en tu dispositivo cuando visitas nuestro sitio web. Nos permiten reconocer tu navegador, recordar preferencias, respaldar procesos técnicos como reservas de citas y mejorar el rendimiento. Las cookies pueden ser: Cookies de sesión: eliminadas una vez que se cierra el navegador. Cookies persistentes: permanecen en tu dispositivo por un período definido. De primera parte: establecidas por Ta' To' Clean. De terceros: establecidas por proveedores de servicios externos.",
            "types_title": "Tipos de Cookies que Usamos",
            "types_necessary_subtitle": "3.1 Cookies Estrictamente Necesarias",
            "types_necessary_text": "Estas cookies son esenciales para el funcionamiento del sitio web y para habilitar servicios como: Completar reservas de citas. Almacenamiento temporal de información de reserva (nombre, correo electrónico, teléfono, fecha preferida y placa del vehículo). Seguridad del sitio web y prevención de fraude. Funcionalidad técnica. Estas cookies no se pueden deshabilitar.",
            "types_functional_subtitle": "3.2 Cookies Funcionales / de Preferencias",
            "types_functional_text": "Se utilizan para mejorar la experiencia del usuario al recordar: Configuración de idioma. Preferencias básicas de página. Retención opcional de datos del formulario.",
            "types_analytical_subtitle": "3.3 Cookies Analíticas y de Rendimiento",
            "types_analytical_text": "Se utilizan para evaluar: Cómo los usuarios interactúan con el proceso de reserva. Secciones más visitadas del sitio web. Rendimiento del sitio web, tasas de rebote y errores. Los análisis de terceros pueden incluir: Google Analytics, Meta Pixel, Herramientas de monitoreo del proveedor de alojamiento. Estas requieren consentimiento del usuario.",
            "types_marketing_subtitle": "3.4 Cookies de Marketing y Seguimiento (si aplica)",
            "types_marketing_text": "Se utilizan para: Medir la efectividad de la publicidad. Realizar campañas de remarketing. Construir perfiles de intereses anónimos. Estas requieren consentimiento explícito.",
            "info_collected_title": "Información Recopilada a través de Cookies",
            "info_collected_text": "Dependiendo del tipo de cookie, pueden recopilar: Dirección IP, Características del dispositivo, Tipo de navegador, Identificadores de sesión, Pasos del proceso de reserva, Interacciones de clics del usuario, Fecha y hora de las visitas. Las cookies no almacenan datos personales sin procesar (nombre, correo electrónico, teléfono o placa de matrícula), pero pueden interactuar con sistemas donde dichos datos se envían de forma segura.",
            "managing_title": "Gestión de Cookies",
            "managing_text": "Los usuarios pueden configurar, aceptar o rechazar cookies (excepto las cookies necesarias) a través del banner de cookies y de la configuración del navegador. Limitar las cookies puede afectar la funcionalidad de reserva.",
            "updates_title": "Actualizaciones de esta Política de Cookies",
            "updates_text": "Ta' To' Clean puede actualizar esta política en cualquier momento. La fecha de 'Última actualización' reflejará los cambios."
        }
    }
}
